app/controllers/api/spots_controller.rb

SELECT "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
      @spot = Spot.find(params[:id])