app/controllers/api/spots_controller.rb

SELECT "spots".* FROM "spots" WHERE "spots"."state" = $1 AND "spots"."listing_type" = $2  [["state", "California"], ["listing_type", "campsite"]]
SELECT "spots".* FROM "spots" WHERE "spots"."state" = $1  [["state", "California"]]
SELECT "spots".* FROM "spots" WHERE "spots"."listing_type" = $1  [["listing_type", ""]]
SELECT "spots".* FROM "spots" WHERE "spots"."max_guests" IS NULL
---
    def index

      if filter_count > 1
        if state && guest_range
          @spots = Spot.where(state: state).where(max_guests: guest_range)
        elsif (state && type)
          @spots = Spot.where(state: state).where(listing_type: type)
        else
          @spots = Spot.where(max_guests: guest_range).where(listing_type: type)
        end
      elsif filter_count == 1
        @spots = Spot.where(state: state) if state
        @spots = Spot.where(listing_type: type) if type
        @spots = Spot.where(max_guests: guest_range) if guest_range

SELECT "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @spot = Spot.find(params[:id])