app/controllers/api/spots_controller.rb

SELECT "spots".* FROM "spots"
---
    def index

      # # @spots = @spots.in_bounds(bounds) if bounds

      # if filter_count > 1
      #   if state && guest_range
      #     @spots = Spot.where(state: state).where(max_guests: guest_range)
      #   elsif (state && type)
      #     @spots = Spot.where(state: state).where(listing_type: type)
      #   else
      #     @spots = Spot.where(max_guests: guest_range).where(listing_type: type)
      #   end
      # elsif filter_count == 1
      #   @spots = Spot.where(state: state) if state
      #   @spots = Spot.where(listing_type: type) if type
      #   @spots = Spot.where(max_guests: guest_range) if guest_range
      # else
        @spots = Spot.all