app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    # render json: user_params

    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "session_token", "created_at", "updated_at", "date_of_birth", "phone_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"